using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace MonstarBookTools.Models
{
    public class CardService
    {
        private const string cards = @"1	ゼリッピ	5	200	1000	10	1	1	1	1	1	1	0	F	F	F	F	F	F	F	Card01_01.png	属性UP[土]-1	HP回復+1	属性UP[雷]+1
1	スリーピーマン	5	200	1000	10	1	1	1	1	1	0	0	F	F	F	F	F	F	F	Card01_02.png	属性UP[火]-1	属性UP[土]+1	仁王立ち+1
1	トゥートゥー	5	200	1000	10	1	1	1	1	1	0	0	F	F	F	F	F	F	F	Card01_03.png	MP回復+1	初速+1	経験値増加+1
1	テディ	5	200	1000	10	1	1	1	1	1	0	0	F	F	F	F	F	F	F	Card01_04.png	観察+1	HACK増加+1
1	ミネ	5	200	1000	10	1	1	1	1	1	1	1	F	F	F	F	F	F	F	Card01_05.png	HP吸収+1	一心不乱+1
1	ハゼ	5	200	1000	10	1	1	1	1	1	0	0	F	F	F	F	F	F	F	Card01_06.png	属性UP[雷]-1	属性UP[水]+1	追撃[水]+1
1	スコルピノ	5	200	1000	10	1	1	1	2	0	1	1	F	F	F	F	F	F	F	Card01_07.png	DEF増加+1	STAB成長+1
1	森の精霊	5	200	1000	10	0	0	1	0	1	0	1	F	F	F	F	F	F	F	Card01_08.png	属性UP[火]-1	属性UP[白]+1	INT成長+1
1	ハリネズミ	5	200	1000	10	1	0	0	0	0	0	0	F	F	F	F	F	F	F	Card01_09.png	痛恨の一撃+1	匠の技+1
1	ゼリッピリ	5	200	1000	10	2	2	1	2	1	1	1	F	F	F	F	F	F	F	Card01_10.png	属性UP[雷]-1	鋼の肌+1	天の裁き+1
1	ベービング	5	200	1000	10	2	1	0	1	1	1	1	F	F	F	F	F	F	F	Card01_11.png	属性UP[白]-1	属性UP[黒]+1	DEX成長+1	女神の微笑+1
1	ハニービー	5	200	1000	10	1	1	0	0	1	1	0	F	F	F	F	F	F	F	Card01_12.png	属性UP[火]-1	属性UP[風]+1	AGI増加+1
2	フラワーゼリッピ	10	1000	2000	10	1	1	1	1	1	0	0	F	F	F	F	E	F	F	Card02_01.png	属性UP[水]-1	属性UP[火]+1	戦闘鼓舞+1
2	葉っぱマン	10	1000	2000	10	1	1	1	1	1	0	0	F	F	F	F	F	F	F	Card02_02.png	属性UP[火]-1	属性UP[土]+1
2	トト	10	1000	2000	10	1	1	0	1	1	0	0	E	E	F	F	F	F	F	Card02_03.png	SP回復+1	日々の恩恵+1
2	スモールマトリョーシカ	10	1000	2000	10	1	1	1	1	1	0	0	E	E	E	E	F	F	F	Card02_04.png	匠の技-1	自己再生+1
2	ワイルドキャット	10	1000	2000	10	1	1	1	1	1	1	1	F	F	F	F	F	F	F	Card02_05.png	夜行性+1	旋風撃+1
2	クラーケンジュニア	10	1000	2000	10	1	1	2	2	1	1	1	F	F	F	F	F	F	F	Card02_06.png	属性UP[雷]-1	属性UP[水]+1	スプラッシュ+1
2	ポイズンスコルピノ	10	1000	2000	10	2	1	1	2	1	1	1	F	F	F	F	F	F	F	Card02_07.png	DEX増加+1	不意打ち+1
2	ウィングクリスタル	10	1000	2000	10	1	1	1	1	1	1	0	F	F	F	F	F	F	F	Card02_08.png	属性UP[火]-1	属性UP[風]+1	周囲騒然+1
2	ウサギ剣士	10	1000	2000	10	1	1	1	1	1	0	1	E	F	F	F	F	F	F	Card02_09.png	STAB増加+1	耐久の初撃+1
2	ラルヴァ	10	1000	2000	10	2	2	3	3	1	1	1	F	F	F	F	F	F	F	Card02_10.png	瞬足-1	鈍足+1	成長期+1
2	クルーエルベービング	10	1000	2000	10	2	1	1	0	1	1	1	F	F	F	F	F	F	F	Card02_11.png	属性UP[白]-1	属性UP[黒]+1	財力+1	追撃[黒]+1
2	ホースビー	10	1000	2000	10	1	1	1	1	1	1	1	F	F	F	F	F	F	F	Card02_12.png	属性UP[火]-1	属性UP[風]+1	AGI成長+1	追撃[風]+1
3	リーフゼリッピ	15	10000	5000	10	0	0	1	0	1	0	0	E	E	D	E	E	F	F	Card03_01.png	属性UP[土]-1	属性UP[雷]+1	追撃[雷]+1
3	カニボレ	15	10000	5000	10	1	1	0	1	0	0	0	E	E	F	E	F	F	F	Card03_02.png	属性UP[火]-1	属性UP[土]+1	追撃[土]+1
3	きのこ芋虫	15	10000	5000	10	1	1	2	2	1	1	1	F	F	E	E	F	F	F	Card03_03.png	SP吸収+1	MR増加+1
3	ビッグマトリョーシカ	15	10000	5000	10	1	1	1	1	1	0	0	E	E	E	E	F	F	F	Card03_04.png	合成職人+1	緊急回避+1
3	ワイズキャット	15	10000	5000	10	1	1	2	2	2	1	1	F	F	F	F	F	F	F	Card03_05.png	INT増加+1	致命打+1
3	プニック	15	10000	5000	10	2	2	2	2	2	1	1	F	F	F	F	F	F	F	Card03_06.png	属性UP[雷]-1	属性UP[水]+1	MP吸収+1
3	コクーン	15	10000	5000	10	1	1	1	1	1	0	0	E	E	E	D	E	F	F	Card03_07.png	DEF成長+1	MR成長+1
3	クレミノ	15	10000	5000	10	1	1	2	1	2	1	1	F	F	E	F	E	F	F	Card03_08.png	属性UP[黒]-1	属性UP[白]+1	追撃[白]+1
3	平原ダックウォーリア	15	10000	5000	10	2	2	1	2	1	1	1	F	F	F	F	F	F	F	Card03_09.png	宝探し+1	HACK成長+1
3	スカルウォーリア	15	10000	5000	10	2	3	1	3	1	1	1	F	F	F	F	F	F	F	Card03_10.png	属性UP[白]-1	属性UP[黒]+1	不死の力+1
3	ドグサ	15	10000	5000	10	1	2	1	1	1	1	1	E	E	F	F	F	F	F	Card03_11.png	属性UP[白]-1	属性UP[黒]+1	瞬足+1	生存本能+1
3	ウィンキィ	15	10000	5000	10	1	1	2	1	1	1	1	F	F	E	F	F	F	F	Card03_12.png	属性UP[火]-1	属性UP[風]+1	追撃[火]+1	魔法耐性+1
4	ポイズンゼリッピ	20	20000	10000	10	1	1	0	1	0	0	0	D	D	E	E	E	F	F	Card04_01.png	属性UP[風]-2	属性UP[土]+2	追撃[土]+2
4	パピィルーム	20	20000	10000	10	1	1	2	1	1	1	1	F	F	D	E	E	F	F	Card04_02.png	属性UP[火]-2	属性UP[土]+2	自己再生+2
4	トルコトゥートゥー	20	20000	10000	10	1	1	1	1	1	0	0	D	D	F	D	E	F	F	Card04_03.png	生存本能+2	女神の微笑+2
4	ハートベア	20	20000	10000	10	2	1	1	1	1	1	1	D	E	F	E	F	F	F	Card04_04.png	STAB増加+2	SP回復+2
4	レッドミネ	20	20000	10000	10	1	2	2	2	2	1	1	F	F	F	F	F	F	F	Card04_05.png	夜行性+2	DEX成長+2
4	武士ハゼ	20	20000	10000	10	1	1	1	1	1	0	0	E	D	E	E	E	F	F	Card04_06.png	属性UP[雷]-2	属性UP[水]+2	追撃[雷]+2	HACK成長+2
4	ピティーチャップ	20	20000	10000	10	3	3	1	3	1	1	1	F	F	F	F	F	F	F	Card04_07.png	属性UP[雷]-2	属性UP[水]+2	DEF成長+2	経験値増加+2
4	ミラクル	20	20000	10000	10	1	2	2	2	2	0	0	F	E	E	E	E	F	F	Card04_08.png	MR成長+2	天の裁き+2
4	イジワル	20	20000	10000	10	3	2	2	3	1	1	1	F	F	F	F	F	F	F	Card04_09.png	属性UP[雷]-2	属性UP[水]+2	DEX増加+2
4	シクル	20	20000	10000	10	2	3	2	2	1	1	1	F	F	F	F	F	F	F	Card04_10.png	属性UP[白]-2	属性UP[黒]+2	HACK増加+2	不死の力+2
4	シャピアー	20	20000	10000	10	3	2	1	1	1	1	1	E	F	F	F	F	F	F	Card04_11.png	属性UP[雷]-2	合成職人-2	属性UP[水]+2	STAB成長+2
4	ユニビ	20	20000	10000	10	2	1	1	1	2	1	1	E	F	F	F	E	F	F	Card04_12.png	属性UP[黒]-2	属性UP[白]+2	MR増加+2
5	ポイズンリーフゼリッピ	25	40000	20000	10	1	1	1	1	1	0	0	D	D	D	E	D	F	E	Card05_01.png	属性UP[風]-2	属性UP[土]+2	合成職人+2
5	バクマンジュウ	25	40000	20000	10	1	1	2	2	2	1	1	F	F	E	E	E	F	F	Card05_02.png	属性UP[火]-2	属性UP[土]+2	仁王立ち+2	致命打+2
5	ゴムバブル	25	40000	20000	10	3	4	2	4	3	1	1	F	F	F	F	F	F	F	Card05_03.png	属性UP[火]-2	日々の恩恵+2
5	ビックテディ	25	40000	20000	10	3	4	1	3	1	1	1	F	E	F	F	F	F	F	Card05_04.png	匠の技+2	観察+2
5	サングラミネ	25	40000	20000	10	1	2	2	2	2	2	1	F	F	F	F	F	F	F	Card05_05.png	DEX増加-2	旋風撃+2
5	ボクサーハゼ	25	40000	20000	10	1	1	1	1	1	1	1	D	D	F	E	E	F	F	Card05_06.png	属性UP[雷]-2	属性UP[水]+2	戦闘鼓舞+2	AGI成長+2
5	アレネ	25	40000	20000	10	4	2	3	4	2	1	1	F	F	F	F	F	F	F	Card05_07.png	鈍足+2	MP吸収+2
5	クレミノタトゥー	25	40000	20000	10	1	1	2	1	2	1	1	F	F	E	F	E	F	F	Card05_08.png	属性UP[黒]-2	属性UP[白]+2	INT増加+2	追撃[白]+2
5	海岸ダックウォーリア	25	40000	20000	10	2	2	2	2	1	1	1	E	E	F	E	F	F	F	Card05_09.png	スプラッシュ+2	追撃[水]+2
5	バンデージヴァンプ	25	40000	20000	10	3	4	2	2	1	2	2	F	F	F	F	F	F	F	Card05_10.png	属性UP[白]-2	HP回復-2	属性UP[黒]+2	追撃[黒]+2	HP吸収+2
5	ミンクス	25	40000	20000	10	2	4	1	2	1	1	1	E	E	F	F	F	F	F	Card05_11.png	AGI増加+2	不意打ち+2
5	モス	25	40000	20000	10	1	1	1	2	2	1	1	F	F	F	E	E	F	F	Card05_12.png	属性UP[火]-2	属性UP[風]+2	周囲騒然+2
6	ゼリーキング	30	80000	50000	10	2	2	2	4	4	1	1	F	F	F	E	E	F	F	Card06_01.png	初速+2	HP回復+2
6	プラバ	30	80000	50000	10	3	3	2	3	4	1	1	F	F	F	F	E	F	F	Card06_02.png	属性UP[火]-2	属性UP[土]+2
6	トゥートゥーキング	30	80000	50000	10	1	1	2	1	1	1	1	E	E	C	E	D	E	F	Card06_03.png	財力+2	INT成長+2
6	ストーンゴーレムジュニア	30	80000	50000	10	1	1	1	1	0	0	0	D	C	E	B	E	F	E	Card06_04.png	属性UP[風]-2	属性UP[土]+2	鋼の肌+2
6	ハニーベア	30	80000	50000	10	2	3	2	4	3	1	1	F	F	F	E	F	F	F	Card06_05.png	一心不乱+2	SP吸収+2
6	バイキングハゼ	30	80000	50000	10	1	1	1	1	1	1	1	D	D	E	D	E	F	E	Card06_06.png	属性UP[雷]-2	属性UP[水]+2	宝探し+2	緊急回避+2
6	サザエキャップ	30	80000	50000	10	3	3	2	4	2	1	1	F	F	F	E	F	F	F	Card06_07.png	属性UP[雷]-2	属性UP[水]+2	DEF増加+2
6	ピケル	30	80000	50000	10	1	1	3	1	3	1	1	F	F	D	F	D	F	F	Card06_08.png	属性UP[水]-2	属性UP[火]+2	追撃[火]+2
6	洞窟ダックウォーリア	30	80000	50000	10	3	3	2	3	1	1	1	E	E	F	E	F	F	F	Card06_09.png	痛恨の一撃+2	耐久の初撃+2
6	グランドラルヴァ	30	80000	50000	10	3	3	4	4	2	1	2	F	F	F	F	F	F	F	Card06_10.png	属性UP[白]-2	属性UP[黒]+2	MP回復+2
6	サイモン	30	80000	50000	10	4	4	4	4	2	1	1	F	F	F	F	F	F	F	Card06_11.png	属性UP[土]-2	属性UP[雷]+2	魔法耐性+2
6	ラバプライア	30	80000	50000	10	2	2	2	3	1	1	1	E	E	E	D	F	F	F	Card06_12.png	属性UP[火]-2	属性UP[風]+2	瞬足+2	追撃[風]+2
7	アイスゼリッピ	35	160000	100000	10	1	1	1	1	1	0	0	D	D	C	C	D	E	E	Card07_01.png	INT増加-3	属性UP[雷]-3	属性UP[水]+3	鈍足+3	追撃[水]+3
7	パンプキン	35	160000	100000	10	2	4	2	4	4	1	2	F	E	F	E	E	F	F	Card07_02.png	自己再生-3	属性UP[火]-3	属性UP[土]+3	痛恨の一撃+3	仁王立ち+3
7	マグマバブル	35	160000	100000	10	3	6	2	5	3	1	1	F	F	F	F	F	F	F	Card07_03.png	SP回復-3	属性UP[水]-3	属性UP[火]+3	宝探し+3	追撃[火]+3
7	スノーピカ	35	160000	100000	10	1	1	1	2	1	1	1	E	E	E	D	E	E	E	Card07_04.png	生存本能-3	周囲騒然+3	MP回復+3	女神の微笑+3
7	ハスキー	35	160000	100000	10	3	3	3	3	3	2	2	F	F	F	F	F	F	F	Card07_05.png	SP吸収-3	日々の恩恵+3	DEX増加+3	自己再生+3
7	巫女ハゼ	35	160000	100000	10	1	1	1	1	1	1	1	D	D	E	E	D	E	E	Card07_06.png	属性UP[雷]-3	属性UP[黒]-3	戦闘鼓舞+3	追撃[白]+3	魔法耐性+3
7	クレム	35	160000	100000	10	4	4	2	4	2	2	1	E	E	F	E	F	F	F	Card07_07.png	DEX増加-3	属性UP[雷]-3	属性UP[水]+3	DEF増加+3
7	アジダハカ	35	160000	100000	10	2	1	1	1	2	1	1	C	E	E	E	C	E	E	Card07_08.png	夜行性-3	属性UP[土]-3	属性UP[雷]+3	初速+3	AGI成長+3
7	スキア	35	160000	100000	10	2	4	4	2	2	2	2	F	E	E	F	F	F	F	Card07_09.png	仁王立ち-3	瞬足+3	追撃[風]+3	HACK成長+3
7	デビルナイト	35	160000	100000	10	4	6	3	4	1	1	2	F	F	F	F	F	F	F	Card07_10.png	初速-3	属性UP[白]-3	属性UP[黒]+3	不死の力+3	HACK増加+3
7	ムスケル	35	160000	100000	10	4	4	1	3	2	1	1	E	E	F	E	F	F	F	Card07_11.png	属性UP[水]-3	痛恨の一撃-3	属性UP[火]+3	一心不乱+3	HP吸収+3
7	クリセラ	35	160000	100000	10	1	1	1	2	3	2	2	F	F	F	E	D	E	E	Card07_12.png	DEF増加-3	属性UP[火]-3	属性UP[風]+3	天の裁き+3	MR増加+3
8	イグルージャム	40	320000	200000	10	2	2	3	5	5	1	1	F	F	F	E	E	F	F	Card08_01.png	戦闘鼓舞-3	属性UP[雷]-3	属性UP[水]+3	スプラッシュ+3	DEF成長+3	観察+3
8	ブルームバンブー	40	320000	200000	10	1	1	1	1	1	0	1	D	D	E	B	B	E	D	Card08_02.png	自己再生-3	属性UP[火]-3	属性UP[土]+3	追撃[土]+3	経験値増加+3
8	トゥートゥークイーン	40	320000	200000	10	2	2	3	1	2	1	1	E	E	C	E	D	F	E	Card08_03.png	属性UP[黒]-3	属性UP[白]+3	財力+3	INT成長+3
8	クリスタルトランプドール	40	320000	200000	10	1	2	1	1	1	1	1	D	B	E	E	E	E	E	Card08_04.png	一心不乱-3	成長期+3	緊急回避+3
8	タトゥーベア	40	320000	200000	10	3	3	2	5	4	1	2	F	F	F	E	E	F	F	Card08_05.png	AGI増加-3	旋風撃+3	匠の技+3
8	グレートハゼ	40	320000	200000	10	2	2	1	1	1	1	1	B	B	E	D	D	E	F	Card08_06.png	属性UP[雷]-3	属性UP[水]+3	HP回復+3	MR成長+3
8	エンピニオン	40	320000	200000	10	2	2	5	6	6	1	1	F	F	F	E	E	F	F	Card08_07.png	瞬足-3	属性UP[雷]-3	属性UP[水]+3	鋼の肌+3	MP吸収+3	INT増加+3
8	真アジダハカ	40	320000	200000	10	2	1	1	1	1	1	1	A	E	E	E	C	D	E	Card08_08.png	不意打ち-3	属性UP[土]-3	属性UP[雷]+3	夜行性+3	追撃[雷]+3	STAB成長+3
8	武闘虎	40	320000	200000	10	2	2	1	3	1	1	1	D	D	E	C	E	F	E	Card08_09.png	MP回復-3	生存本能+3	SP回復+3	AGI増加+3
8	ポーウン	40	320000	200000	10	5	5	2	5	2	1	2	F	F	F	F	F	F	F	Card08_10.png	属性UP[白]-3	魔法耐性-3	属性UP[黒]+3	追撃[黒]+3	SP吸収+3
8	ログルベグル	40	320000	200000	10	4	1	2	2	1	1	2	C	F	E	E	F	F	E	Card08_11.png	鋼の肌-3	女神の微笑-3	不意打ち+3	耐久の初撃+3	STAB増加+3
8	ハンド	40	320000	200000	10	2	2	2	1	2	2	2	E	E	E	F	E	E	E	Card08_12.png	DEX増加-3	合成職人+3	致命打+3	DEX成長+3
9	ダスティングボンベマン	45	500000	300000	10	3	1	2	1	2	1	1	A	D	B	D	B	F	D	Card09_01.png
9	怪物の木	45	500000	300000	10	6	4	3	5	6	2	1	D	E	F	E	D	F	F	Card09_02.png	仁王立ち+3
9	ゴーレムコマンドー	45	500000	300000	10	6	4	3	6	6	1	1	D	E	F	D	D	F	F	Card09_03.png	合成運↑Lv+1
9	プレタ	45	500000	300000	10	1	1	3	3	3	1	1	E	E	B	B	C	F	E	Card09_04.png	グロウス+1
9	ワイルドボー	45	500000	300000	10	4	2	2	4	2	2	2	C	E	E	C	E	E	E	Card09_05.png	合成運↑St+1
9	ユニシール	45	500000	300000	10	4	2	4	4	2	2	2	C	E	C	C	E	E	E	Card09_06.png	追撃[白]+3
9	スクープ	45	500000	300000	10	3	3	6	6	5	2	2	F	F	D	D	E	F	F	Card09_07.png	合成運↑Rk+1
9	河童	45	500000	300000	10	2	1	2	2	1	1	1	B	D	B	B	D	E	E	Card09_08.png	初速+3
9	チカブム	45	500000	300000	10	2	2	3	4	3	2	2	E	E	D	C	D	E	E	Card09_09.png	一心不乱+3
9	夜幻影	45	500000	300000	10	2	2	3	4	4	2	2	E	E	D	C	C	E	E	Card09_10.png	ドロー↑St+1
9	ウィッキド	45	500000	300000	10	4	3	2	3	4	2	1	C	D	E	D	C	E	F	Card09_11.png	合成運↑MB+1
9	フレイムリザード	45	500000	300000	10	1	1	3	2	3	1	1	D	D	A	C	A	E	E	Card09_12.png	属性UP[火]+3
10	亡念のグール	50	600000	400000	10	3	7	3	3	2	4	4	E	B	E	D	C	E	D	Card10_01.png
10	トゥームスコルピノ	50	600000	400000	10	4	4	3	4	3	4	4	C	C	D	C	D	C	C	Card10_02.png
10	ゾンビマスター	50	600000	400000	10	3	3	5	2	8	2	3	E	E	C	E	D	E	D	Card10_03.png	財力+3	戦闘鼓舞+3	生存本能+1	耐久の初撃+2	日々の恩恵-1	瞬足-2	MR増加+4
10	ゾンビ	50	600000	400000	10	5	8	2	2	3	3	3	C	D	E	E	E	E	D	Card10_04.png	AGI増加-1	HP回復-2	自己再生-1	グロウス+3	観察+1	緊急回避+2	HACK増加+4
10	幽霊狩猟犬	50	600000	400000	10	8	5	2	2	3	3	3	D	C	E	E	E	E	D	Card10_05.png	自己再生+1	周囲騒然-2	スプラッシュ+1	匠の技+2	観察-1	宝探し+3	STAB増加+4
10	スケルトンマーダラー	50	600000	400000	10	3	7	2	3	2	5	4	E	B	E	D	D	E	D	Card10_06.png
10	猛毒の注視者	50	600000	400000	10	3	3	8	2	5	2	3	E	E	D	E	C	E	D	Card10_07.png	属性UP[黒]+3	追撃[黒]+1	不死の力+2	初速-3	鈍足-2	夜行性+2	INT増加+4
10	ミイラ	50	600000	400000	10	2	2	3	5	7	2	5	E	E	E	E	B	E	E	Card10_08.png	DEF成長+1	属性UP[白]-3	一心不乱+1	財力+1	女神の微笑+2	DEX増加+2	DEF増加+4
10	ラミア	50	600000	400000	10	2	2	7	3	3	4	5	E	E	B	D	E	D	E	Card10_09.png	鋼の肌+1	属性UP[黒]-3	AGI増加+1	DEX成長+1	追撃[雷]+1	属性UP[風]-1	DEX増加+4
10	モロス	50	600000	400000	10	7	3	2	3	2	5	4	B	E	E	D	D	E	D	Card10_10.png	MP吸収-3	SP吸収-2	自己再生+1	周囲騒然+1	致命打-1	匠の技+2	AGI増加+4
10	ヘカテー	50	600000	400000	10	6	6	2	4	2	4	2	C	C	E	D	E	E	F	Card10_11.png	HACK増加-1	STAB増加-1	致命打+3	周囲騒然+1	合成職人+2	SP回復+3	食いしん坊+1
10	使命の継承者ニックス	50	600000	400000	10	2	2	6	4	6	2	4	E	E	C	D	C	F	E	Card10_12.png	MP吸収-3	SP吸収-3	HACK増加-3	瞬足-3	AGI増加+3	DEX増加+3	女神の微笑+4
11	プロム	55	2000000	1000000	10	5	3	2	4	4	1	2	A	C	D	A	B	E	D	Card11_01.png	属性UP[火]-3	属性UP[雷]+3	DEF増加-4	財力-2	追撃[雷]+3	HP回復+3
11	ステッド	55	2000000	1000000	10	8	5	6	6	7	2	3	C	A	D	D	D	F	F	Card11_02.png	属性UP[風]-3	属性UP[白]+3	AGI増加-4	不死の力-3	追撃[白]+3	MP回復+3
11	ケリッド	55	2000000	1000000	10	6	3	5	6	5	2	3	C	A	E	C	D	F	E	Card11_03.png	属性UP[土]-3	属性UP[水]+3	初速-2	鈍足-3	追撃[水]+3	SP回復+3	食いしん坊+2
11	カサード	55	2000000	1000000	10	4	3	5	4	5	2	3	C	D	B	C	A	A	D	Card11_04.png	属性UP[黒]-3	属性UP[土]+3	成長期+3	一心不乱-3	追撃[土]+3	女神の微笑+3	瞬足+4
11	フェイド	55	2000000	1000000	10	5	3	3	5	4	2	3	B	D	D	A	C	E	A	Card11_05.png	属性UP[水]-3	属性UP[風]+3	夜行性-3	仁王立ち-3	追撃[風]+3	匠の技+3	耐久の初撃+4
11	セリオン	55	2000000	1000000	10	6	4	3	5	3	2	1	A	A	D	B	B	E	F	Card11_06.png	DEX増加-4	一心不乱+3	自己再生-3	SP吸収+3	STAB成長+3	AGI増加+5	STAB増加+5
11	セレアナ	55	2000000	1000000	10	6	6	3	3	3	2	2	B	A	A	D	B	E	E	Card11_07.png	MR増加-4	戦闘鼓舞+2	属性UP[火]+3	SP回復-3	追撃[火]+3	HACK成長+3	HACK増加+5
11	シライロン	55	2000000	1000000	10	4	2	6	2	4	2	2	B	D	A	D	A	D	D	Card11_08.png	HACK増加-4	MP吸収+3	鋼の肌-3	HP回復-3	DEF成長+3	HP吸収+3	DEF増加+5
11	シルバン	55	2000000	1000000	10	4	2	3	3	4	2	2	A	D	C	B	A	D	A	Card11_09.png	INT増加-4	生存本能+3	不意打ち-3	MP回復-3	DEX成長+3	AGI成長+3	DEX増加+5
11	ルミナス	55	2000000	1000000	10	7	4	5	7	6	3	4	D	A	A	D	A	F	E	Card11_10.png	STAB増加-4	MR成長+3	属性UP[黒]+3	魔法耐性+3	追撃[黒]+3	MR増加+5	INT増加+5
特殊	凶暴なキョンシードール	10	200	1000	1	2	2	2	2	2	2	2	E	E	E	E	E	E	E	SpecialCard01.png	成長期+1	経験値増加+1	女神の微笑+2	痛恨の一撃+2	スプラッシュ+2	瞬足+2
特殊	ガトリングキャノン	1	1	1	1	1	1	1	1	1	1	1	F	F	F	F	F	F	F	SpecialCard02.png	属性UP[火]+1	追撃[火]+1	瞬足+2	女神の微笑+1
特殊	クリスタルゴーレム	1	1	1	1	1	1	1	1	1	1	1	F	F	F	F	F	F	F	SpecialCard03.png	属性UP[水]+1	追撃[水]+1	瞬足+2	女神の微笑+1
特殊	グリフォン	1	1	1	1	1	1	1	1	1	1	1	F	F	F	F	F	F	F	SpecialCard04.png	属性UP[風]+1	追撃[風]+1	瞬足+2	女神の微笑+1
特殊	オスウォム	1	1	1	1	1	1	1	1	1	1	1	F	F	F	F	F	F	F	SpecialCard05.png	属性UP[土]+1	追撃[土]+1	瞬足+2	女神の微笑+1
特殊	フォックスフード	1	1	1	1	1	1	1	1	1	1	1	F	F	F	F	F	F	F	SpecialCard06.png	属性UP[雷]+1	追撃[雷]+1	瞬足+2	女神の微笑+1
特殊	大和にゃでし子	1	1	1	1	1	1	1	1	1	1	1	F	F	F	F	F	F	F	SpecialCard07.png	属性UP[白]+1	追撃[白]+1	瞬足+2	女神の微笑+1
特殊	白拍死	1	1	1	1	1	1	1	1	1	1	1	F	F	F	F	F	F	F	SpecialCard08.png	属性UP[黒]+1	追撃[黒]+1	瞬足+2	女神の微笑+1";
        private const string skills = @"回復系	#FBDAC8	HP回復	MP回復	SP回復	HP吸収	MP吸収	SP吸収	食いしん坊	自己再生	緊急回避
属性値上昇	#FEECD2	属性UP[火]	属性UP[水]	属性UP[風]	属性UP[土]	属性UP[雷]	属性UP[白]	属性UP[黒]
カードステータス上昇	#FFFCDB	STAB増加	HACK増加	INT増加	DEF増加	MR増加	DEX増加	AGI増加	STAB成長	HACK成長	INT成長	DEF成長	MR成長	DEX成長	AGI成長
ダメージ軽減系	#ECF4D9	鋼の肌	魔法耐性	仁王立ち
その他自己強化系	#D5EAD8	初速	瞬足	致命打
追加ダメージ	#D4ECEA	追撃[火]	追撃[水]	追撃[風]	追撃[土]	追撃[雷]	追撃[白]	追撃[黒]	一心不乱	戦闘鼓舞	夜行性	不意打ち	財力	不死の力	生存本能	耐久の初撃
周辺敵ダメージ	#D3EDFB	天の裁き	旋風撃	スプラッシュ
敵状態異常付与	#D3DEF1	周囲騒然	鈍足	痛恨の一撃
アイテム取得関連	#D2CCE6	女神の微笑	合成職人	宝探し	日々の恩恵
キャラクター経験値	#E7D5E8	経験値増加	成長期
カード経験値	#FADCE9	観察	グロウス
カード作成用	#FADBDA	匠の技	ドロー↑St	合成運↑Lv	合成運↑St	合成運↑Rk	合成運↑MB";

        public static CardData[] CardDatas { get; } = cards.Split("\r\n")
            .Select(ln => ln.Split("\t"))
            .Select(arr => new CardData(arr[1], arr[0], int.Parse(arr[2]), int.Parse(arr[3]), int.Parse(arr[4]), int.Parse(arr[5]), arr[6..13].Select(i => int.Parse(i)), arr[13..20], arr[20], arr[21..].Select(s => Skill.Parse(s))))
            .ToArray();

        public static CardData? GetCardData(string? name) => CardDatas.SingleOrDefault(cd => cd.Name == name);

        public static SkillData[] SkillDatas { get; } = skills.Split("\r\n")
            .Select(ln => ln.Split("\t"))
            .SelectMany(arr => arr[2..].Select(sn => new SkillData(sn, arr[1], CardDatas.SelectMany(c => c.Skills).Where(s => s.Name == sn).Select(s => s.Lv).Distinct().OrderByDescending(l => l).ToArray())))
            .ToArray();
    }
}
